ags/readme.org

#+title: Ags Configuration
#+author: A7R7
#+language:en

#+auto_tangle: t
#+PROPERTY: header-args:typescript :tangle main.ts :comments link
* Dependencies
cava
wl-copy
* Import
#+begin_src typescript
const { GLib } = imports.gi;
import { GetClassIcon } from './utils.js';
import brightness from './brightness.js';
const hello = () => Widget.Label(' ');
#+end_src

* Cava
#+begin_src typescript
const cava = Variable('', {
    listen: [['python3', App.configDir + '/cava.py'], out => JSON.parse(out)],
});
#+end_src

* COMMENT Taskbar v1
#+begin_src typescript
const hyprland = await Service.import('hyprland');
const clients = hyprland.bind('clients');
const activeWs = hyprland.active.workspace;
const activeCli = hyprland.active.client;
#+end_src

** Client Button
#+begin_src typescript
const ClientButton = (client) => {
    const address = client.address;
    const mapped = client.mapped;
    const className = client.class;
    const title = client.title;
    return Widget.Box({
        class_name: 'client',
        hpack: 'center',
        child: Widget.Button({
            on_clicked: () => hyprland.messageAsync(
                `dispatch focuswindow address:${address}`),
            on_scroll_up: () => hyprland.messageAsync(
                `dispatch workspace m-1`),
            on_scroll_down: () => hyprland.messageAsync(
                `dispatch workspace m+1`),
            on_secondary_click: (_, event) => {
                const MenuItems = [];
                for (const key in client) {
                    MenuItems.push(Widget.MenuItem({
                        child: Widget.Label({
                            hpack: 'start',
                            label: `${key} : ${client[key]}`,
                        }),
                        on_activate: Utils.execAsync('notify-send hello'),
                    }))
                }
                return Widget.Menu({children: MenuItems,})
                    .on("notify::visible", (self) => {
                        if (!self.visible)
                            self.destroy()}) // prevent gc issues
                    .popup_at_pointer(event)
            },
            child: Widget.Icon({
                icon: GetClassIcon(className),
                size: 40,
            }),
            tooltip_text: title,
            setup: self => self.hook(activeCli, () => {
                self.toggleClassName('active', activeCli.address === address)
                self.toggleClassName('inactive', activeCli.address != address)
            }),
        })
    })
}
#+end_src
** Workspace
#+begin_src typescript
const WorkspaceBox = (cls, id) => Widget.Box({
    class_name: 'workspace',
    vertical: true,
    children: [
        Widget.Box({
            hexpand: false,
            child:Widget.Label({label: id.toString(),})
        })
    ].concat(cls.map(ClientButton)),
    setup: self => self.hook(activeWs, () => {
        self.toggleClassName("active", activeWs.id === id)
        self.toggleClassName("inactive", activeWs.id != id)
    }),
})
#+end_src
** Taskbar
#+begin_src typescript
const Taskbar = () => Widget.Box({
    class_name: 'taskbar',
    vertical: true,
    children: clients.as(clients => clients
        .filter(({ workspace: {id}, class: c }) => c.length > 0 && id > 0 )
        .reduce((x, cli) => {
            const id = cli.workspace.id;
            if (id > 0) {(x[id] = x[id] || []).push(cli);}
            return x;
        }, [])
        .map(WorkspaceBox))
});
#+end_src

* Taskbar v2
** Service
#+begin_src typescript
export const hyprland = await Service.import('hyprland');
const activeWs = hyprland.active.workspace;
const activeCli = hyprland.active.client;
const dispatch = cmd => hyprland.messageAsync(`dispatch ${cmd}`);

globalThis.hyprland = hyprland;
#+end_src
** Client button
#+begin_src typescript
#+end_src
** Workspace box
#+begin_src typescript
const wsLabels = ["󰎤","󰎧","󰎪","󰎭","󰎱","󰎳","󰎶","󰎹","󰎼","󰎡"];
const WsBox = (id) => {
    const label = wsLabels[(id - 1) % 10];
    return Widget.Box({
        class_name: 'workspace',
        vertical: true,
        attribute: { id },
        children: [
            Widget.Label({
                visible: false,
                attribute: {address: 'label'},
                class_name: 'nerd-icons',
                label: label,
            }),
        ],
        setup: self => self
            .hook(activeWs, () => {
                self.toggleClassName('active', activeWs.id === id)
                self.toggleClassName('inactive', activeWs.id != id)
            })
    })
};

#+end_src
** Normal Taskbar
#+begin_src typescript
// manages workspaces in [start, start + length - 1]
const NormalTaskbar = (start, length) => {
    const CliButton = (address: string) => {
        const cli = hyprland.getClient(address);
        return Widget.Box({
            class_name: 'client',
            hpack: 'center',
            attribute: {address},
            child: Widget.Button ({
                on_clicked: () =>
                    hyprland.messageAsync(`dispatch focuswindow address:${address}`),
                child: Widget.Icon({
                    icon: GetClassIcon(cli.class),
                    size: 32,
                }),
                tooltip_text: cli.title,
            }),
            setup: self => self.hook(activeCli, () => {
                self.toggleClassName('active', activeCli.address === cli.address)
                self.toggleClassName('inactive', activeCli.address != cli.address)
            }),
        })
    };
    const AddCliBtn = (self, address?: string) => {
        const id = hyprland.getClient(address).workspace.id;
        const child = self.children.find(w => w.attribute.id === id);
        if (child) {
            child.children = [...child.children, CliButton(address)];
            print('client-added', address, id)
        } else {
            print('client-add-failed', address, id)
        }
    };
    const RemoveCliBtn = (self, address?: string) => {
        const id = hyprland.getClient(address).workspace.id;
        const child = self.children.find(w => w.attribute.id === id);
        if (child) {
            child.children = child.children
                .filter(cli => cli.attribute.address !== address)
            print('client-removed', address, id)
        } else {
            print('client-removed-failed', address, id)
        }
    };
    // Assume name === string(id) for normal workspaces.
    const AddWsBox = (self, name?: string) => {
        print('workspace-add', name);
        const id = Number(name); // if name == 'special:xx', Number(name) == NaN.
        if (!id || id < start || id >= start + length) return;
        const ws = WsBox(id);
        var i = self.children.findIndex(ws => ws.attribute.id > id);
        i = i === -1? self.children.length : i;
        self.children = self.children.toSpliced(i, 0, ws);
        print('workspace-added', name, i);
    };
    const RemoveWsBox = (self, name?: string) => {
        print('workspace-remove', name);
        const id = Number(name);
        if (!id || id < start || id >= start + length) return;
        self.children = self.children.filter(ws => ws.attribute.id !== id);
        print('workspace-removed', name);
    };
    return Widget.Box({
        class_name: "normal taskbar",
        vertical: true,
        children: [],
        setup: self => {
            hyprland.workspaces.map(ws => AddWsBox(self, ws.name))
            hyprland.clients.map(cli => AddCliBtn(self, cli.address));
            self.hook(hyprland, AddWsBox, 'workspace-added')
                .hook(hyprland, RemoveWsBox, 'workspace-removed')
                .hook(hyprland, AddCliBtn, 'client-added')
                .hook(hyprland, RemoveCliBtn, 'client-removed');
                .hook(hyprland, (w, event?: string) => {
                    if (event === "movewindow")
                        w.children = sortItems(w.children)
                }, "event"),
        }
    })
}
#+end_src
