ags/main.ts
// [[file:readme.org::*Import][Import:1]]
const { GLib } = imports.gi;
import { GetClassIcon } from './utils.js';
import brightness from './brightness.js';
const hello = () => Widget.Label(' ');
// Import:1 ends here

// [[file:readme.org::*Cava][Cava:1]]
const cava = Variable('', {
    listen: [['python3', App.configDir + '/cava.py'], out => JSON.parse(out)],
});
// Cava:1 ends here

// [[file:readme.org::*Service][Service:1]]
export const hyprland = await Service.import('hyprland');
const activeWs = hyprland.active.workspace;
const activeCli = hyprland.active.client;
const dispatch = cmd => hyprland.messageAsync(`dispatch ${cmd}`);

globalThis.hyprland = hyprland;
// Service:1 ends here

// [[file:readme.org::*Client button][Client button:1]]

// Client button:1 ends here

// [[file:readme.org::*Workspace box][Workspace box:1]]
const wsLabels = ["󰎤","󰎧","󰎪","󰎭","󰎱","󰎳","󰎶","󰎹","󰎼","󰎡"];
const WsBox = (id) => {
    const label = wsLabels[(id - 1) % 10];
    return Widget.Box({
        class_name: 'workspace',
        vertical: true,
        attribute: { id },
        children: [
            Widget.Label({
                visible: false,
                attribute: {address: 'label'},
                class_name: 'nerd-icons',
                label: label,
            }),
        ],
        setup: self => self
            .hook(activeWs, () => {
                self.toggleClassName('active', activeWs.id === id)
                self.toggleClassName('inactive', activeWs.id != id)
            })
    })
};
// Workspace box:1 ends here

// [[file:readme.org::*Normal Taskbar][Normal Taskbar:1]]
// manages workspaces in [start, start + length - 1]
const NormalTaskbar = (start, length) => {
    const CliButton = (address: string) => {
        const cli = hyprland.getClient(address);
        return Widget.Box({
            class_name: 'client',
            hpack: 'center',
            attribute: {address},
            child: Widget.Button ({
                on_clicked: () =>
                    hyprland.messageAsync(`dispatch focuswindow address:${address}`),
                child: Widget.Icon({
                    icon: GetClassIcon(cli.class),
                    size: 32,
                }),
                tooltip_text: cli.title,
            }),
            setup: self => self.hook(activeCli, () => {
                self.toggleClassName('active', activeCli.address === cli.address)
                self.toggleClassName('inactive', activeCli.address != cli.address)
            }),
        })
    };
    const AddCliBtn = (self, address?: string) => {
        const id = hyprland.getClient(address).workspace.id;
        const child = self.children.find(w => w.attribute.id === id);
        if (child) {
            child.children = [...child.children, CliButton(address)];
            print('client-added', address, id)
        } else {
            print('client-add-failed', address, id)
        }
    };
    const RemoveCliBtn = (self, address?: string) => {
        const id = hyprland.getClient(address).workspace.id;
        const child = self.children.find(w => w.attribute.id === id);
        if (child) {
            child.children = child.children
                .filter(cli => cli.attribute.address !== address)
            print('client-removed', address, id)
        } else {
            print('client-removed-failed', address, id)
        }
    };
    // Assume name === string(id) for normal workspaces.
    const AddWsBox = (self, name?: string) => {
        print('workspace-add', name);
        const id = Number(name); // if name == 'special:xx', Number(name) == NaN.
        if (!id || id < start || id >= start + length) return;
        const ws = WsBox(id);
        var i = self.children.findIndex(ws => ws.attribute.id > id);
        i = i === -1? self.children.length : i;
        self.children = self.children.toSpliced(i, 0, ws);
        print('workspace-added', name, i);
    };
    const RemoveWsBox = (self, name?: string) => {
        print('workspace-remove', name);
        const id = Number(name);
        if (!id || id < start || id >= start + length) return;
        self.children = self.children.filter(ws => ws.attribute.id !== id);
        print('workspace-removed', name);
    };
    return Widget.Box({
        class_name: "normal taskbar",
        vertical: true,
        children: [],
        setup: self => {
            hyprland.workspaces.map(ws => AddWsBox(self, ws.name))
            hyprland.clients.map(cli => AddCliBtn(self, cli.address));
            self.hook(hyprland, AddWsBox, 'workspace-added')
                .hook(hyprland, RemoveWsBox, 'workspace-removed')
                .hook(hyprland, AddCliBtn, 'client-added')
                .hook(hyprland, RemoveCliBtn, 'client-removed');
        }
    })
}
// Normal Taskbar:1 ends here
