ags/readme.org
** System info
#+begin_src typescript
const SystemInfo = () => Widget.Box({
    class_name: 'system-info',
    vertical: true,
    spacing: 10,
    children: [
        BluetoothIndicator(),
        NetworkIndicator(),
        Widget.Separator({ orientation: 1 }),
        audioControl(),
        brightnessControl(),
        batteryProgress(),
    ],
});
#+end_src

* Audio Visualizer
#+begin_src typescript
const AudioVisualizer = (id) => Widget.ProgressBar({
    class_name: 'audio-visualizer',
    vertical: true,
    expand: true,
    value: cava.bind().as(c => c[id]),
    setup: self => self.set_inverted(true),
});
#+end_src
* Window
** Left Bar
#+begin_src typescript
const barL = () => Widget.Window({
    name: 'bar-left',
    class_name: 'bg left',
    anchor: ['left', 'top', 'bottom'],
    exclusivity: 'exclusive',
    monitor: 0,
    child: Widget.Box({
        class_name: 'bar left',
        child: Widget.Overlay({
            child: Widget.Box({expand: true}),
            overlays: [
                AudioVisualizer(0),
                Widget.CenterBox({
                    vertical: true,
                    start_widget: Widget.Box({
                        vertical: true,
                        children: [
                            SysTray(),
                            Widget.Separator({orientation:1}),
                        ],
                    }),
                    center_widget: NormalTaskbar(1, 10),
                    end_widget: Widget.Box({
                        vpack: "end",
                        vertical: true,
                        children: [
                            Widget.Separator({orientation:1}),
                            SpecialTaskbar(),
                        ]
                    })
                }),
            ],
        }),
    }),
});
#+end_src

** Right Bar
#+begin_src typescript
const barR = () => Widget.Window({
    name: 'bar-right',
    class_name: 'bg right',
    anchor: ['right', 'top', 'bottom'],
    exclusivity: 'exclusive',
    monitor: 0,
    child: Widget.Box({
        class_name: 'bar right',
        child: Widget.Overlay({
            child: Widget.Box({expand: true}),
            overlays: [
                AudioVisualizer(1),
                Widget.CenterBox({
                    vertical: true,
                    start_widget: FancyClock(),
                    center_widget: hello(),
                    end_widget: Widget.Box({
                        vpack: "end",
                        vertical: true,
                        children: [
                            SystemInfo(),
                        ]
                    })
                }),
            ],
        })
    })
});
#+end_src

** Top Bottom Bar
#+begin_src typescript
const barB = () => Widget.Window({
    name: 'bar-bottom',
    class_name: 'bg bottom',
    exclusivity: 'exclusive',
    anchor: ['bottom', 'left', 'right'],
    layer: 'top',
    child: Widget.Box({css:'min-height: 20px;'}),
});
const barT = () => Widget.Window({
    name: 'bar-top',
    class_name: 'bg top',
    exclusivity: 'exclusive',
    anchor: ['top', 'left', 'right'],
    layer: 'top',
    child: Widget.Box({css:'min-height: 20px;'}),
});
#+end_src
* Export
#+begin_src typescript
const scss = `${App.configDir}/style.scss`
const css = `/tmp/ags/style.css`
Utils.exec(`sassc ${scss} ${css}`)
Utils.monitorFile(
    `${App.configDir}`,
    function() {
        // compile, reset, apply
        try {
            Utils.exec(`sassc ${scss} ${css}`)
        } catch (error) {
            console.error(error)
        }
        App.resetCss()
        App.applyCss(css)
    },
)
const setup = Variable(
    App.applyCss(css)
)

const windows = [
    barL(),
    barR(),
    barB(),
    barT(),

];
export default {
    windows: windows,
};
globalThis.windows = windows
#+end_src

#+begin_src js :tangle config.js
const entry = App.configDir + '/main.ts'
const outdir = '/tmp/ags'

try {
    await Utils.execAsync([
        'bun', 'build', entry,
        '--outdir', outdir,
        '--external', 'resource://*',
        '--external', 'gi://*',
    ])
} catch (error) {
    console.error(error)
}

const main = await import(`file://${outdir}/main.js`)

export default main.default
#+end_src
