ags/main.ts

// [[file:readme.org::*System info][System info:1]]
const SystemInfo = () => Widget.Box({
    class_name: 'system-info',
    vertical: true,
    spacing: 10,
    children: [
        BluetoothIndicator(),
        NetworkIndicator(),
        Widget.Separator({ orientation: 1 }),
        audioControl(),
        brightnessControl(),
        batteryProgress(),
    ],
});
// System info:1 ends here

// [[file:readme.org::*Audio Visualizer][Audio Visualizer:1]]
const AudioVisualizer = (id) => Widget.ProgressBar({
    class_name: 'audio-visualizer',
    vertical: true,
    expand: true,
    value: cava.bind().as(c => c[id]),
    setup: self => self.set_inverted(true),
});
// Audio Visualizer:1 ends here

// [[file:readme.org::*Left Bar][Left Bar:1]]
const barL = () => Widget.Window({
    name: 'bar-left',
    class_name: 'bg left',
    anchor: ['left', 'top', 'bottom'],
    exclusivity: 'exclusive',
    monitor: 0,
    child: Widget.Box({
        class_name: 'bar left',
        child: Widget.Overlay({
            child: Widget.Box({expand: true}),
            overlays: [
                AudioVisualizer(0),
                Widget.CenterBox({
                    vertical: true,
                    start_widget: Widget.Box({
                        vertical: true,
                        children: [
                            SysTray(),
                            Widget.Separator({orientation:1}),
                        ],
                    }),
                    center_widget: NormalTaskbar(1, 10),
                    end_widget: Widget.Box({
                        vpack: "end",
                        vertical: true,
                        children: [
                            Widget.Separator({orientation:1}),
                            SpecialTaskbar(),
                        ]
                    })
                }),
            ],
        }),
    }),
});
// Left Bar:1 ends here

// [[file:readme.org::*Right Bar][Right Bar:1]]
const barR = () => Widget.Window({
    name: 'bar-right',
    class_name: 'bg right',
    anchor: ['right', 'top', 'bottom'],
    exclusivity: 'exclusive',
    monitor: 0,
    child: Widget.Box({
        class_name: 'bar right',
        child: Widget.Overlay({
            child: Widget.Box({expand: true}),
            overlays: [
                AudioVisualizer(1),
                Widget.CenterBox({
                    vertical: true,
                    start_widget: FancyClock(),
                    center_widget: hello(),
                    end_widget: Widget.Box({
                        vpack: "end",
                        vertical: true,
                        children: [
                            SystemInfo(),
                        ]
                    })
                }),
            ],
        })
    })
});
// Right Bar:1 ends here

// [[file:readme.org::*Top Bottom Bar][Top Bottom Bar:1]]
const barB = () => Widget.Window({
    name: 'bar-bottom',
    class_name: 'bg bottom',
    exclusivity: 'exclusive',
    anchor: ['bottom', 'left', 'right'],
    layer: 'top',
    child: Widget.Box({css:'min-height: 20px;'}),
});
const barT = () => Widget.Window({
    name: 'bar-top',
    class_name: 'bg top',
    exclusivity: 'exclusive',
    anchor: ['top', 'left', 'right'],
    layer: 'top',
    child: Widget.Box({css:'min-height: 20px;'}),
});
// Top Bottom Bar:1 ends here

// [[file:readme.org::*Export][Export:1]]
const scss = `${App.configDir}/style.scss`
const css = `/tmp/ags/style.css`
Utils.exec(`sassc ${scss} ${css}`)
Utils.monitorFile(
    `${App.configDir}`,
    function() {
        // compile, reset, apply
        try {
            Utils.exec(`sassc ${scss} ${css}`)
        } catch (error) {
            console.error(error)
        }
        App.resetCss()
        App.applyCss(css)
    },
)
const setup = Variable(
    App.applyCss(css)
)

const windows = [
    barL(),
    barR(),
    barB(),
    barT(),

];
export default {
    windows: windows,
};
globalThis.windows = windows
// Export:1 ends here
